<template>
    <div class="container">
        <h1>서비스 이용약관</h1>
        <div class="article">
            <h2>총칙</h2>
            <p>이 약관은 팀 봄bee(이하 "회사"라고 합니다)가 "꿀단지" 인터넷 오픈마켓 사이트를 통하여 제공하는 경매서비스, 매매보호서비스 및 기타 정보서비스(이하 "서비스"라고 합니다)와 관련하여
                회사와 회원 간의 권리와 의무, 책임사항 및 회원의 서비스 이용 절차에 관한 사항을 규정함을 목적으로 합니다.</p>

            <h3>제1조 (목적)</h3>
            <p>이 약관은 팀 봄bee(이하 “회사” 라고 합니다.) 가 "꿀단지" 인터넷 오픈마켓 사이트를 통하여 제공하는 경매서비스, 매매보호서비스 및 기타 정보서비스(이하 "서비스"라고 합니다)와
                관련하여 회사와 회원간의 권리와 의무, 책임사항 및 회원의 서비스이용절차에 관한 사항을 규정함을 목적으로 합니다.</p>

            <h3>제2조 (약관의 명시, 효력 및 변경)</h3>
            <p>1) 회사는 이 약관을 서비스를 이용하고자 하는 자와 회원이 알 수 있도록 서비스가 제공되는 꿀단지 사이트의 초기화면(이하 연결화면 포함)에 게시합니다.
                <br>2) 회사가 이 약관을 개정하는 경우에는 개정된 약관의 적용일자 및 개정사유를 명시하여 현행 약관과 함께 그 적용일자 14일 이전부터 적용일자 전일까지 위 가항의 방법으로
                공지합니다. 다만, 변경 내용이 중대하거나 회원에게 불리한 경우에는 그 적용일자 30일 이전부터 적용일자 전일까지 위 가항의 방법으로 공지하고 회원에게 개별 통지합니다. 개정된 약관은
                적용일자 이전으로 소급하여 적용되지 아니합니다.
                <br>3) 이 약관은 회사와 회원간에 성립되는 서비스이용계약의 기본약정입니다. 회사는 필요한 경우 특정 서비스에 관하여 적용될 사항(이하 "개별약관"이라고 합니다)을 정하여 미리 공지할
                수 있습니다. 회원이 이러한 개별약관에 동의하고 특정 서비스를 이용하는 경우에는 개별약관이 우선적으로 적용되고, 이 약관은 보충적인 효력을 갖습니다. 개별약관의 게시ㆍ변경에 관해서는 위
                가항, 나항을 준용합니다. 단, 회사는 개별약관을 꿀단지 사이트의 판매자 화면에 게시할 수 있습니다.
                <br>4) 회사는 특정 판매자와 개별적으로 이 약관 및 개별약관(이하 "약관 등"이라고 합니다)에 규정된 내용과 다른 내용의 계약(이하 "개별계약"이라고 합니다)을 체결할 수 있습니다.
                이 경우 개별계약이 약관등에 우선하여 적용됩니다. 회사는 개별계약을 체결한 판매자에게 계약내용을 서면(전자 문서 포함)교부하거나 판매자 화면에서 확인할 수 있도록 합니다.
            </p>

            <h3>제3조 (관련법령과의 관계)</h3>
            <p>1) 이 약관 또는 개별약관에서 정하지 않은 사항은 전기통신사업법, 전자거래기본법, 정보통신망이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련
                법령의 규정과 일반적인 상관례에 의합니다.
                <br>2) 회원은 회사가 제공하는 서비스를 이용함에 있어서 전자상거래 등에서의 소비자보호에 관한 법률(예시: 전자문서, 표시광고, 반품, 배송 등 통신판매에 관한 규정), 전자문서 및
                전자거래기본법(예시:소비자보호에 관한 규정), 소비자기본법(예시:사업자의 의무에 관한 규정), 표시광고의 공정화에 관한 법률(예시:물품상세설명에 관련한 표시, 기재사항),
                정보통신망이용촉진 및 정보보호 등에 관한법률(예시:개인정보보호에 관한 규정) 등 관련법령을 준수하여야 하며, 이 약관의 규정을 들어 관련법령 위반에 대한 면책을 주장할 수 없습니다.
            </p>
            <h3>제3조의 1 (회사의 일반적 준수사항)</h3>
            <p>1) 회사는 수수료(제29조의 등록서비스이용료, 부가서비스이용료, 판매서비스이용료 등 회사가 판매자에게 서비스를 제공한 대가로 판매자로부터 받는 일체의 금원을 말함. 이하 제3조의1에서
                같음) 및 판매촉진서비스이용료의 결정과 관련하여 다른 오픈마켓사업자와 담합 등 불공정행위를 하지 않습니다.
                <br>2) 회사는 판매자에게 가격인하, 기획전 참여 등을 부당하게 강요하지 않습니다.
                <br>3) 회사는 판매자간 수수료 및 판매촉진서비스 이용료를 다르게 정하지 않습니다. 다만, 회사는 합리적인 사유가 있는 경우에는 이를 다르게 정할 수 있습니다.
                <br>4) 회사는 판매자가 다른 오픈마켓사업자와 거래하지 못하게 하거나 다른 오픈마켓사업자와 거래한다는 이유로 판매자에게 불이익을 제공하지 아니합니다.
            </p>

            <h3>제4조 (서비스의 종류)</h3>
            <p>
                회사가 회원에게 제공하는 서비스는 다음과 같습니다.
            <ol>
                <li>일반경매서비스 : 회사가 꿀단지 사이트를 통하여 회원 상호간에 물품매매거래가 이루어질 수 있는 사이버 거래장소를 온라인으로 제공하는 서비스 및 관련 부가서비스 일체를 말합니다.
                    회사는 판매자의 물품판매의 촉진을 위한 관련 부가서비스로서 판매자의 상품노출을 위한 전시권 등 판매촉진서비스를 유상으로 제공할 수 있습니다.</li>
                <li>매매보호서비스 : 판매자가 꿀단지 사이트에 등록한 물품을 구매자가 낙찰 받고자 하는 경우 회사가 제공하는 결제서비스 및/또는 매매보호서비스와 관련 부가서비스 일체를 말합니다.
                </li>
                <li>매칭거래서비스: 판매자가 등록한 판매 가격과 구매자가 등록한 구매 가격이 일치할 경우 매칭시켜 거래를 성사시키는 서비스를 말합니다.</li>
                <li>꿀거래: 1대1로 구매자가 구매를 희망하는 제품을 판매하는 판매자에게 컨택하여 개인간 거래를 가능하게 하는 서비스를 말합니다. 매매보호서비스를 제공합니다.</li>
                <li>기타 정보서비스 : 경매서비스 또는 매매보호서비스 이외에 회사가 꿀단지 사이트를 통하여 회원에게 온라인으로 제공하는 정보서비스 등의 인터넷서비스를 말합니다.</li>
            </ol>
            </p>

            <h3>제5조 (용어의 정의)</h3>
            <p> 이 약관에서 사용하는 용어의 정의는 아래와 같다.
            <ol>
                <li>“사이트”라 함은 “회사”가 서비스를 “회원” 에게 제공하기 위하여 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함) 등 정보통신설비를 이용하여 설정한 가상의
                    영업장 또는 회사가 각각 운영하는 웹사이트를 말하며, 통합된 하나의 아이디 및 비밀번호(이하 “통합 계정”)를 이용하여 서비스를 제공받을 수 있는 아래의 사이트로 정의한다.
                    <br>- 꿀단지: *.honeypot.co.kr
                </li>
                <li>서비스: “회사”가 기업(단체, 사업자, 기관) 또는 개인이 공식 상품의 양도, 교환, 구매를 위한 자료를 DB화하여 각각의 목적에 맞게 분류 가공, 집계하여 정보를 제공하는
                    서비스와 해당 인터넷 주소에서 제공하는 모든 부대 서비스를 말한다.</li>
                <li>회원: 이 약관을 승인하고 회사와 서비스이용계약을 체결한 자를 말한다. 회원은 가입형태에 따라 개인회원으로, 서비스 이용목적에 따라 구매자회원, 판매자회원 및 구매 및
                    판매자회원으로 각 구분되며 상호간 회사가 정하는 바에 따라 전환할 수 있다. 구매 및 판매자회원에 대해서는 구매자회원과 판매자회원에게 적용되는 이 약관의 규정이 모두 적용된다.
                </li>
                <li>이메일: 회원의 식별과 서비스 이용을 위하여 회원이 설정하고 회사가 승인한 문자와 숫자의 조합을 말한다.</li>
                <li>비밀번호: 회원의 동일성 확인과 회원정보의 보호를 위하여 회원이 설정하고 회사가 승인한 문자와 숫자의 조합을 말한다.</li>
                <li>판매자: 물품을 판매할 의사로 해당 물품을 회사가 온라인으로 제공하는 양식에 맞추어 회사의 꿀단지 사이트에 매매보호서비스를 통한 물품 등록을 한 회원을 말한다.</li>
                <li>구매자: 물품을 낙찰받은 회원을 말한다.</li>
                <li>입찰: 물품을 구매하기 위하여 원하는 매수가격을 제출하거나(일반경매의 경우) 판매자가 지정한 가격(즉시구매의 경우)에 의한 구매의사를 표시하는 행위를 말합니다.</li>
                <li>낙찰: 입찰에 의하여 물품의 거래가 성립되는 것을 말합니다.</li>
                <li>일반경매: 입찰자 중 최고가격 입찰자에게 낙찰이 이루어지는 경매방식을 말합니다.</li>
                <li>즉시거래: 판매자가 표시한 즉시구매가격에 입찰하고 결제완료 또는 주문서 작성으로써 낙찰이 이루어지는 경매방식을 말합니다.</li>
                <li>경매: 본 약관에서 경매란 일반경매, 즉시거래를 포함하는 개념입니다.</li>
                <li>매매보호 서비스: 회사가 경매서비스를 통하여 회원 상호간에 이루어지는 거래의 안전을 위하여 물품대금의 입출금을 중개할 목적으로 마련한 절차를 말합니다.</li>
                <li>꿀거래: 매매보호서비스를 제공받아 검수되지 않은 제품을 판매자와 구매자가 직접 물품대금을 주고받는 행위를 말합니다.</li>
                <li>마이페이지: 회사가 구매자회원의 구매정보, 기타 회원정보 등을 모아 구매자회원이 경매서비스를 신속하고 편리하게 이용하도록 하기 위하여 제공하는 서비스화면을 말합니다.</li>
                <li>닉네임: 꿀단지 사이트에서 아이디와 함께, 또는 아이디를 대신하여 판매자를 식별하기 위하여 이용자의 신청과 회사의 승인에 의하여 설정되는 숫자와 문자의 조합입니다.</li>
                <li>오픈마켓판매자: 오픈마켓과 오픈마켓에서의 부가서비스(광고서비스 등)를 제공하고, 이에 대한 대가를 받는 판매자를 말합니다.</li>
                <li>굿즈: 해당 아이돌의 사진이나 로고가 새겨진 의류, 액세서리, 스티커, 포토카드 등의 제품을 말합니다.</li>
            </ol>
            위 항에서 정의되지 않은 이 약관 상의 용어의 의미는 일반적인 거래관행에 의합니다.
            </p>

        </div>

        <!-- Section for 서비스 이용 계약 -->
        <div class="article">
            <h2>제 2장 서비스 이용 계약</h2>
            <h3>제6조 (서비스 이용신청)</h3>
            <p>1) 회원으로 가입하여 본 서비스를 이용하고자 하는 이용고객은 필요시 회사에서 요청하는 제반정보(이름, 소속, 연락처)를 제공하여야 한다.
                <br>2) 본인의 연락처를 이용하여 등록하지 않은 회원은 일체의 권리를 주장할 수 없다.
                <br>3) 타인의 명의를 도용하여 이용신청을 한 회원의 모든 ID는 삭제 되며, 관계법령에 따라 처벌을 받을 수 있다.
                <br>4) 만 14세 미만자의 회원가입은 금지되며 성명, 연령, 기타 이용신청서의 정보를 허위로 기재한 경우에는 회원가입이 이루어진 이후라도 이용정지, 강제탈퇴 등 제재조치가 이루어질
                수 있으며 이로
                인하여 회사에 손해가 발생한 경우 회사는 해당 회원에게 손해배상청구를 할 수 있다.
            </p>

            <h3>제7조 (이용신청의 승낙과 제한)</h3>
            <p>1) 회사는 전조의 규정에 이한 이용신청 고객에 대하여 업무수행상 또는 기술상 지장이 없는 경우에는 원칙적으로 접수순서에 따라 서비스 이용을 승낙한다.
                <br>2) 회사는 아래 사항에 해당하는 경우에 대해서는 이용신청을 승낙하지 아니할 수 있다:
            <ol>
                <li>실명이 아니거나 타인의 명의 또는 정보를 이용하여 신청한 경우</li>
                <li>이용계약 신청서의 내용을 허위로 기재하거나 이용신청 요건을 충족하지 못한 경우</li>
                <li>이용신청자가 만 14세 미만의 아동인 경우</li>
                <li>이용신청자가 본인인증에 실패한 경우</li>
                <li>회사가 서비스를 제공하지 않은 국가에서 비정상적이거나 우회적인 방법을 통해 서비스를 이용하는 경우</li>
                <li>관련 법령에서 금지하는 행위 또는 사회의 안녕과 질서 또는 미풍양속을 저해할 목적으로 서비스 이용을 신청하는 경우</li>
                <li>영리를 추구할 목적으로 서비스를 이용하고자 하는 경우</li>
                <li>이용약관 위반으로 회원 자격을 박탈당하고 재가입하는 경우</li>
                <li>그 밖에 이에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우</li>
            </ol>
            3) 회사는 아래사항에 해당하는 경우에는 그 신청에 대하여 승낙제한 사유가 해소될 때까지 승낙을 유보할 수 있다:
            <ol>
                <li>회사가 설비의 여유가 없는 경우</li>
                <li>회사의 기술상 지장이 있는 경우</li>
                <li>기타 회사의 사정(회사의 귀책사유 있는 경우도 포함)으로 이용승낙이 곤란한 경우</li>
            </ol>
            </p>
        
            <h3>제8조 (서비스의 내용)</h3>
            <p>1) 회사는 제2조 2항의 서비스를 제공할 수 있으며 그 내용은 다음 각 호와 같다:
            <ol>
                <li>굿즈 양도, 교환, 구매 매칭 진행과 관련된 일체의 제반 서비스</li>
                <li>회원이 등록한 DB를 활용한 광고 서비스</li>
                <li>기타 회사가 추가 개발하거나 제휴계약 등을 통해 회원에게 제공하는 일체의 서비스</li>
            </ol>
            2) 회사의 서비스와 관련된 세부 규정 사항은 별도로 사이트에 표시하거나 안내한다.</p>

            <h3>제9조 (제휴를 통한 서비스)</h3>
            <p>1) 회사는 제휴 관계를 체결한 여타 인터넷 웹 사이트 또는 신문, 잡지 등의 오프라인 매체를 통해 사이트에 등록한 개인회원의 정보가 열람될 수 있도록 서비스를 제공할 수 있다.
                <br>2) 회사는 제휴를 통해 타 사이트 및 매체에 등록될 수 있음을 고지하여야 하며, 제휴 사이트 전체 목록을 사이트 내에서 상시 열람할 수 있도록 해야 한다.
            </p>
        
            <h3>제10조 (서비스의 요금)</h3>
            <p>1) 개인회원의 회원 가입은 무료이다. 다만, 서비스 중 매칭을 디테일하게 진행하기 위한 부가서비스 등 회원 가입 목적 외 기타 서비스를 이용하기 위한 별도의 서비스는 유료로 제공될 수
                있다.
                <br>2) 회사는 유료서비스를 제공할 경우 사이트에 요금에 대해서 공지를 하여야 한다.
                <br>3) 회사는 유료서비스 이용금액이 변경되는 경우 변경된 금액 적용일 최소 7일전부터 웹사이트 초기화면 공지사항 또는 이메일을 통해 고지한다. 다만, 변경 이전에 적용 또는 계약한
                금액은 소급하여
                적용하지 아니한다.
            </p>
        
            <h3>제11조 (청약철회 등)</h3>
            <p> 1) 회사와 재화등의 구매에 관한 계약을 체결한 회원은 「전자상거래 등에서의 소비자보호에 관한법률」 제13조 제2항에 따른 계약내용에 관한 서면을 받은 날(그 서면을 받은 때보다 재화
                등의
                공급이 늦게 이루어진 경우에는 재화 등을 공급받거나 재화 등의 공급이 시작된 날을 말한다.)부터 7일 이내에는 청약의 철회를 할 수 있다. 다만, 청약철회에 관하여 「전자상거래 등에서의
                소비자보호에 관한 법률」에 달리 정함이 있는 경우에는 동 법 규정에 따른다.
                <br>2) 회원은 재화 등을 사용한 경우 다음 각 호의 1에 해당하는 경우에는 환불을 할 수 없다.
            <ol>
                <li>회원이 재화를 사용 또는 일부 소비에 의하여 재화 등의 가치가 현저히 감소한 경우</li>
                <li>시간의 경과에 의하여 재판매가 곤란할 정도로 재화 등의 가치가 현저히 감소한 경우</li>
                <li>같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본인 재화 등의 포장을 훼손한 경우</li>
            </ol>
            3) 제2항 제1호 내지 제2호의 경우에 회사가 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 회원의
            청약철회 등이 제한되지 않는다.
            <br>4) 회원은 제1항 및 제2항의 규정에 불구하고 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 재화 등을 공급받은 날부터 3월 이내, 그 사실을 안 날
            또는 알 수 있었던 날부터 30일 이내에 청약철회 등을 할 수 있다.
            </p>
        
            <h3>제12조 (서비스 이용시간)</h3>
            <p>1) 회사는 특별한 사유가 없는 한 연중무휴, 1일 24시간 서비스를 제공한다. 다만, 회사는 서비스의 종류나 성질에 따라 제공하는 서비스 중 일부에 대해서는 별도로 이용시간을 정할 수
                있으며,
                이 경우 회사는 그 이용시간을 사전에 회원에게 공지 또는 통지하여야 한다.
                <br>2) 회사는 자료의 가공과 갱신을 위한 시스템 작업시간, 장애해결을 위한 보수작업 시간, 정기 PM작업, 시스템 교체작업, 회선 장애 등이 발생한 경우 일시적으로 서비스를 중단할
                수 있으며
                계획된 작업의 경우 공지란에 서비스 중단 시간과 작업 내용을 알려야 한다.
            </p>

            <h3>제13조 (서비스 제공의 중지)</h3>
            <p>1) 회사는 다음 각 호에 해당하는 경우 서비스의 제공을 중지할 수 있다:
            <ol>
                <li>설비의 보수 등 회사의 필요에 의해 사전에 회원들에게 통지한 경우</li>
                <li>기간통신사업자가 전기통신서비스 제공을 중지하는 경우</li>
                <li>기타 불가항력적인 사유에 의해 서비스 제공이 객관적으로 불가능한 경우</li>
            </ol>
            2) 전항의 경우, 회사는 기간의 정함이 있는 유료서비스 이용자들에게는 그 이용기간을 연장하는 등의 방법으로 손실을 보상하여야 한다.</p>
        
            <h3>제14조 (정보의 제공 및 광고의 게재)</h3>
            <p>1) 회사는 회원에게 서비스 이용에 필요가 있다고 인정되거나 서비스 개선 및 회원대상의 서비스 소개 등의 목적으로 하는 각종 정보를 회원이 수신동의한 경우, 전자우편, 서신우편,
                SMS(Short Message Service), MMS(Multimedia Message Service)로 제공할 수 있다.
                <br>2) 회사는 제공하는 서비스와 관련되는 정보 또는 광고를 서비스 화면, 홈페이지 등에 게재할 수 있으며, 회원들에게 전자우편 및 SMS, MMS를 통해 알릴 수 있다.
                <br>3) 회사는 서비스상에 게재되어 있거나 본 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 모든 손실과 손해에 대해, 회사의 고의ㆍ중과실로
                인한
                경우가 아닌 한, 책임을 지지 않는다.
                <br>4) 본 서비스의 회원은 서비스 이용 시 노출되는 광고게재에 대해 동의하는 것으로 간주한다.
            </p>
        
            <h3>제15조 (자료 내용의 책임과 회사의 정보 수정 권한)</h3>
            <p>1) 자료내용은 회원이 등록한 개인정보 및 사이트에 게시한 게시물을 말한다.
                <br>2) 회원은 자료 내용 및 게시물을 사실에 근거하여 성실하게 작성해야 하며, 만일 자료의 내용이 사실이 아니거나 부정확하게 작성되어 발생하는 모든 책임은 회원에게 있다.
                <br>3) 모든 자료내용의 관리와 작성은 회원 본인이 하는 것이 원칙이나 사정상 위탁 또는 대행관리를 하더라도 자료내용의 책임은 회원에게 있으며 회원은 주기적으로 자신의 자료를 확인하여
                항상 정확하게 관리가 되도록 노력해야 한다.
                <br>4) 회사는 개인회원이 등록한 자료 내용에 오자, 탈자 또는 사회적 통념에 어긋나는 문구가 있을 경우 이를 언제든지 수정할 수 있다.
                <br>5) 개인회원이 등록한 자료로 인해 타인(또는 타법인)으로부터 허위사실 및 명예훼손 등으로 삭제 요청이 접수된 경우 회사는 개인회원에게 사전 통지 없이 본 자료를 삭제할 수 있으며
                삭제 후 메일 등의 방법으로 통지할 수 있다.
            </p>

            <h3>제16조 (자료 내용의 활용)</h3>
            <p>1) 개인회원이 입력한 정보는 개인을 식별할 수 없는 형태로 제공되어 관련 동향의 통계 자료로 활용될 수 있으며 그 자료는 매체를 통해 언론에 배포될 수 있다.
                <br>2) 개인회원이 생성한 DB, 게시물, 사이트에 게시한 자료에 대해서는 회사가 홍보 자료로 활용할 수 있다.
            </p>

            <h3>제17조 (회사의 의무)</h3>
            <p>1) 회사는 본 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다해야 한다.
                <br>2) 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우에는 그 사유와 처리일정을 서비스 화면 또는 기타 방법을 통해 동
                회원에게 통지하여야 한다.
                <br>3) 회사는 유료 결제와 관련한 결제 사항 정보를 상법 등 관련법령의 규정에 의하여 5년 이상 보존한다.
                <br>4) 천재지변 등 예측하지 못한 일이 발생하거나 시스템의 장애가 발생하여 서비스가 중단될 경우 이에 대한 손해에 대해서는 회사가 책임을 지지 않는다. 다만 자료의 복구나 정상적인
                서비스 지원이 되도록 최선을 다할 의무를 진다.
                <br>5) 회원의 자료를 본 서비스 이외의 목적으로 제3자에게 제공하거나 열람시킬 경우 반드시 회원의 동의를 얻어야 한다.
                <br>6) 회원이 등록한 자료로 인하여 사이트의 원활한 운영에 영향을 미친다고 판단될 시, 등록된 모든 자료를 회원의 사전 동의 없이 삭제할 수 있다.
            </p>

        </div>
    </div>


</template>

<style>
        body {
            font-family: 'Noto Sans KR', sans-serif;
            line-height: 1.6;
            padding: 20px;
            background-color: #f4f4f9;
            color: #333;
        }
        h1 {
            text-align: center;
            color: #333;
        }
        h2 {
            border-bottom: 2px solid #666;
            color: #444;
            padding-bottom: 3px;
        }
        h3 {
            color: #555;
            padding-top: 10px;
        }
        p, li {
            font-size: 16px;
            color: #666;
            padding: 5px 0;
        }
        ul, ol {
            padding-left: 20px;
        }
        .container {
            width: 80%;
            margin: auto;
            background-color: #fff;
            padding: 20px;
        }
        .article {
            margin-bottom: 20px;
        }
        .clause {
            margin-left: 20px;
        }
    </style>